app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def index
		@user = User.find_by_id params[:user_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def new
		@user = User.find_by_id params[:user_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdasdw"], ["description", "asdsdw"], ["user_id", 1], ["created_at", "2018-07-03 12:56:01.754003"], ["updated_at", "2018-07-03 12:56:01.754003"]]
---
	def create
		@user = User.find_by_id params[:user_id]
		@post = @user.posts.build(posts_params)
		if @post.valid?
			@post.save!